MikroElektronika/core_packages/ARM/gcc_clang/def/sam/ATSAME54P19A/mcu.h
  PERIPH_COUNT_IRQn        = 137  /**< Number of peripheral IDs */
} IRQn_Type;

typedef struct _DeviceVectors
{
  /* Stack pointer */
  void* pvStack;

  /* Cortex-M handlers */
  void* pfnReset_Handler;
  void* pfnNonMaskableInt_Handler;
  void* pfnHardFault_Handler;
  void* pfnMemManagement_Handler;
  void* pfnBusFault_Handler;
  void* pfnUsageFault_Handler;
  void* pvReservedM9;
  void* pvReservedM8;
  void* pvReservedM7;
  void* pvReservedM6;
  void* pfnSVCall_Handler;
  void* pfnDebugMonitor_Handler;
  void* pvReservedM3;
  void* pfnPendSV_Handler;
  void* pfnSysTick_Handler;

  /* Peripheral handlers */
  void* pfnPM_Handler;                    /*  0 Power Manager */
  void* pfnMCLK_Handler;                  /*  1 Main Clock */
  void* pfnOSCCTRL_XOSC0_Handler;         /*  2 Oscillators Control IRQ 0 */
  void* pfnOSCCTRL_XOSC1_Handler;         /*  3 Oscillators Control IRQ 1 */
  void* pfnOSCCTRL_DFLL_Handler;          /*  4 Oscillators Control IRQ 2 */
  void* pfnOSCCTRL_DPLL0_Handler;         /*  5 Oscillators Control IRQ 3 */
  void* pfnOSCCTRL_DPLL1_Handler;         /*  6 Oscillators Control IRQ 4 */
  void* pfnOSC32KCTRL_Handler;            /*  7 32kHz Oscillators Control */
  void* pfnSUPC_OTHER_Handler;            /*  8 Supply Controller IRQ 0 */
  void* pfnSUPC_BODDET_Handler;           /*  9 Supply Controller IRQ 1 */
  void* pfnWDT_Handler;                   /* 10 Watchdog Timer */
  void* pfnRTC_Handler;                   /* 11 Real-Time Counter */
  void* pfnEIC_EXTINT_0_Handler;          /* 12 External Interrupt Controller IRQ 0 */
  void* pfnEIC_EXTINT_1_Handler;          /* 13 External Interrupt Controller IRQ 1 */
  void* pfnEIC_EXTINT_2_Handler;          /* 14 External Interrupt Controller IRQ 2 */
  void* pfnEIC_EXTINT_3_Handler;          /* 15 External Interrupt Controller IRQ 3 */
  void* pfnEIC_EXTINT_4_Handler;          /* 16 External Interrupt Controller IRQ 4 */
  void* pfnEIC_EXTINT_5_Handler;          /* 17 External Interrupt Controller IRQ 5 */
  void* pfnEIC_EXTINT_6_Handler;          /* 18 External Interrupt Controller IRQ 6 */
  void* pfnEIC_EXTINT_7_Handler;          /* 19 External Interrupt Controller IRQ 7 */
  void* pfnEIC_EXTINT_8_Handler;          /* 20 External Interrupt Controller IRQ 8 */
  void* pfnEIC_EXTINT_9_Handler;          /* 21 External Interrupt Controller IRQ 9 */
  void* pfnEIC_EXTINT_10_Handler;         /* 22 External Interrupt Controller IRQ 10 */
  void* pfnEIC_EXTINT_11_Handler;         /* 23 External Interrupt Controller IRQ 11 */
  void* pfnEIC_EXTINT_12_Handler;         /* 24 External Interrupt Controller IRQ 12 */
  void* pfnEIC_EXTINT_13_Handler;         /* 25 External Interrupt Controller IRQ 13 */
  void* pfnEIC_EXTINT_14_Handler;         /* 26 External Interrupt Controller IRQ 14 */
  void* pfnEIC_EXTINT_15_Handler;         /* 27 External Interrupt Controller IRQ 15 */
  void* pfnFREQM_Handler;                 /* 28 Frequency Meter */
  void* pfnNVMCTRL_0_Handler;             /* 29 Non-Volatile Memory Controller IRQ 0 */
  void* pfnNVMCTRL_1_Handler;             /* 30 Non-Volatile Memory Controller IRQ 1 */
  void* pfnDMAC_0_Handler;                /* 31 Direct Memory Access Controller IRQ 0 */
  void* pfnDMAC_1_Handler;                /* 32 Direct Memory Access Controller IRQ 1 */
  void* pfnDMAC_2_Handler;                /* 33 Direct Memory Access Controller IRQ 2 */
  void* pfnDMAC_3_Handler;                /* 34 Direct Memory Access Controller IRQ 3 */
  void* pfnDMAC_OTHER_Handler;            /* 35 Direct Memory Access Controller IRQ 4 */
  void* pfnEVSYS_0_Handler;               /* 36 Event System Interface IRQ 0 */
  void* pfnEVSYS_1_Handler;               /* 37 Event System Interface IRQ 1 */
  void* pfnEVSYS_2_Handler;               /* 38 Event System Interface IRQ 2 */
  void* pfnEVSYS_3_Handler;               /* 39 Event System Interface IRQ 3 */
  void* pfnEVSYS_OTHER_Handler;           /* 40 Event System Interface IRQ 4 */
  void* pfnPAC_Handler;                   /* 41 Peripheral Access Controller */
  void* pvReserved42;
  void* pvReserved43;
  void* pvReserved44;
  void* pfnRAMECC_Handler;                /* 45 RAM ECC */
  void* pfnSERCOM0_0_Handler;             /* 46 Serial Communication Interface 0 IRQ 0 */
  void* pfnSERCOM0_1_Handler;             /* 47 Serial Communication Interface 0 IRQ 1 */
  void* pfnSERCOM0_2_Handler;             /* 48 Serial Communication Interface 0 IRQ 2 */
  void* pfnSERCOM0_OTHER_Handler;         /* 49 Serial Communication Interface 0 IRQ 3 */
  void* pfnSERCOM1_0_Handler;             /* 50 Serial Communication Interface 1 IRQ 0 */
  void* pfnSERCOM1_1_Handler;             /* 51 Serial Communication Interface 1 IRQ 1 */
  void* pfnSERCOM1_2_Handler;             /* 52 Serial Communication Interface 1 IRQ 2 */
  void* pfnSERCOM1_OTHER_Handler;         /* 53 Serial Communication Interface 1 IRQ 3 */
  void* pfnSERCOM2_0_Handler;             /* 54 Serial Communication Interface 2 IRQ 0 */
  void* pfnSERCOM2_1_Handler;             /* 55 Serial Communication Interface 2 IRQ 1 */
  void* pfnSERCOM2_2_Handler;             /* 56 Serial Communication Interface 2 IRQ 2 */
  void* pfnSERCOM2_OTHER_Handler;         /* 57 Serial Communication Interface 2 IRQ 3 */
  void* pfnSERCOM3_0_Handler;             /* 58 Serial Communication Interface 3 IRQ 0 */
  void* pfnSERCOM3_1_Handler;             /* 59 Serial Communication Interface 3 IRQ 1 */
  void* pfnSERCOM3_2_Handler;             /* 60 Serial Communication Interface 3 IRQ 2 */
  void* pfnSERCOM3_OTHER_Handler;         /* 61 Serial Communication Interface 3 IRQ 3 */
  void* pfnSERCOM4_0_Handler;             /* 62 Serial Communication Interface 4 IRQ 0 */
  void* pfnSERCOM4_1_Handler;             /* 63 Serial Communication Interface 4 IRQ 1 */
  void* pfnSERCOM4_2_Handler;             /* 64 Serial Communication Interface 4 IRQ 2 */
  void* pfnSERCOM4_OTHER_Handler;         /* 65 Serial Communication Interface 4 IRQ 3 */
  void* pfnSERCOM5_0_Handler;             /* 66 Serial Communication Interface 5 IRQ 0 */
  void* pfnSERCOM5_1_Handler;             /* 67 Serial Communication Interface 5 IRQ 1 */
  void* pfnSERCOM5_2_Handler;             /* 68 Serial Communication Interface 5 IRQ 2 */
  void* pfnSERCOM5_OTHER_Handler;         /* 69 Serial Communication Interface 5 IRQ 3 */
  void* pfnSERCOM6_0_Handler;             /* 70 Serial Communication Interface 6 IRQ 0 */
  void* pfnSERCOM6_1_Handler;             /* 71 Serial Communication Interface 6 IRQ 1 */
  void* pfnSERCOM6_2_Handler;             /* 72 Serial Communication Interface 6 IRQ 2 */
  void* pfnSERCOM6_OTHER_Handler;         /* 73 Serial Communication Interface 6 IRQ 3 */
  void* pfnSERCOM7_0_Handler;             /* 74 Serial Communication Interface 7 IRQ 0 */
  void* pfnSERCOM7_1_Handler;             /* 75 Serial Communication Interface 7 IRQ 1 */
  void* pfnSERCOM7_2_Handler;             /* 76 Serial Communication Interface 7 IRQ 2 */
  void* pfnSERCOM7_OTHER_Handler;         /* 77 Serial Communication Interface 7 IRQ 3 */
  void* pfnCAN0_Handler;                  /* 78 Control Area Network 0 */
  void* pfnCAN1_Handler;                  /* 79 Control Area Network 1 */
  void* pfnUSB_OTHER_Handler;             /* 80 Universal Serial Bus IRQ 0 */
  void* pfnUSB_SOF_HSOF_Handler;          /* 81 Universal Serial Bus IRQ 1 */
  void* pfnUSB_TRCPT0_Handler;            /* 82 Universal Serial Bus IRQ 2 */
  void* pfnUSB_TRCPT1_Handler;            /* 83 Universal Serial Bus IRQ 3 */
  void* pfnGMAC_Handler;                  /* 84 Ethernet MAC */
  void* pfnTCC0_OTHER_Handler;            /* 85 Timer Counter Control 0 IRQ 0 */
  void* pfnTCC0_MC0_Handler;              /* 86 Timer Counter Control 0 IRQ 1 */
  void* pfnTCC0_MC1_Handler;              /* 87 Timer Counter Control 0 IRQ 2 */
  void* pfnTCC0_MC2_Handler;              /* 88 Timer Counter Control 0 IRQ 3 */
  void* pfnTCC0_MC3_Handler;              /* 89 Timer Counter Control 0 IRQ 4 */
  void* pfnTCC0_MC4_Handler;              /* 90 Timer Counter Control 0 IRQ 5 */
  void* pfnTCC0_MC5_Handler;              /* 91 Timer Counter Control 0 IRQ 6 */
  void* pfnTCC1_OTHER_Handler;            /* 92 Timer Counter Control 1 IRQ 0 */
  void* pfnTCC1_MC0_Handler;              /* 93 Timer Counter Control 1 IRQ 1 */
  void* pfnTCC1_MC1_Handler;              /* 94 Timer Counter Control 1 IRQ 2 */
  void* pfnTCC1_MC2_Handler;              /* 95 Timer Counter Control 1 IRQ 3 */
  void* pfnTCC1_MC3_Handler;              /* 96 Timer Counter Control 1 IRQ 4 */
  void* pfnTCC2_OTHER_Handler;            /* 97 Timer Counter Control 2 IRQ 0 */
  void* pfnTCC2_MC0_Handler;              /* 98 Timer Counter Control 2 IRQ 1 */
  void* pfnTCC2_MC1_Handler;              /* 99 Timer Counter Control 2 IRQ 2 */
  void* pfnTCC2_MC2_Handler;              /* 100 Timer Counter Control 2 IRQ 3 */
  void* pfnTCC3_OTHER_Handler;            /* 101 Timer Counter Control 3 IRQ 0 */
  void* pfnTCC3_MC0_Handler;              /* 102 Timer Counter Control 3 IRQ 1 */
  void* pfnTCC3_MC1_Handler;              /* 103 Timer Counter Control 3 IRQ 2 */
  void* pfnTCC4_OTHER_Handler;            /* 104 Timer Counter Control 4 IRQ 0 */
  void* pfnTCC4_MC0_Handler;              /* 105 Timer Counter Control 4 IRQ 1 */
  void* pfnTCC4_MC1_Handler;              /* 106 Timer Counter Control 4 IRQ 2 */
  void* pfnTC0_Handler;                   /* 107 Basic Timer Counter 0 */
  void* pfnTC1_Handler;                   /* 108 Basic Timer Counter 1 */
  void* pfnTC2_Handler;                   /* 109 Basic Timer Counter 2 */
  void* pfnTC3_Handler;                   /* 110 Basic Timer Counter 3 */
  void* pfnTC4_Handler;                   /* 111 Basic Timer Counter 4 */
  void* pfnTC5_Handler;                   /* 112 Basic Timer Counter 5 */
  void* pfnTC6_Handler;                   /* 113 Basic Timer Counter 6 */
  void* pfnTC7_Handler;                   /* 114 Basic Timer Counter 7 */
  void* pfnPDEC_OTHER_Handler;            /* 115 Quadrature Decodeur IRQ 0 */
  void* pfnPDEC_MC0_Handler;              /* 116 Quadrature Decodeur IRQ 1 */
  void* pfnPDEC_MC1_Handler;              /* 117 Quadrature Decodeur IRQ 2 */
  void* pfnADC0_OTHER_Handler;            /* 118 Analog Digital Converter 0 IRQ 0 */
  void* pfnADC0_RESRDY_Handler;           /* 119 Analog Digital Converter 0 IRQ 1 */
  void* pfnADC1_OTHER_Handler;            /* 120 Analog Digital Converter 1 IRQ 0 */
  void* pfnADC1_RESRDY_Handler;           /* 121 Analog Digital Converter 1 IRQ 1 */
  void* pfnAC_Handler;                    /* 122 Analog Comparators */
  void* pfnDAC_OTHER_Handler;             /* 123 Digital-to-Analog Converter IRQ 0 */
  void* pfnDAC_EMPTY_0_Handler;           /* 124 Digital-to-Analog Converter IRQ 1 */
  void* pfnDAC_EMPTY_1_Handler;           /* 125 Digital-to-Analog Converter IRQ 2 */
  void* pfnDAC_RESRDY_0_Handler;          /* 126 Digital-to-Analog Converter IRQ 3 */
  void* pfnDAC_RESRDY_1_Handler;          /* 127 Digital-to-Analog Converter IRQ 4 */
  void* pfnI2S_Handler;                   /* 128 Inter-IC Sound Interface */
  void* pfnPCC_Handler;                   /* 129 Parallel Capture Controller */
  void* pfnAES_Handler;                   /* 130 Advanced Encryption Standard */
  void* pfnTRNG_Handler;                  /* 131 True Random Generator */
  void* pfnICM_Handler;                   /* 132 Integrity Check Monitor */
  void* pfnPUKCC_Handler;                 /* 133 PUblic-Key Cryptography Controller */
  void* pfnQSPI_Handler;                  /* 134 Quad SPI interface */
  void* pfnSDHC0_Handler;                 /* 135 SD/MMC Host Controller 0 */
  void* pfnSDHC1_Handler;                 /* 136 SD/MMC Host Controller 1 */
} DeviceVectors;

/* Cortex-M4 processor handlers */
void Reset_Handler               ( void );
void NonMaskableInt_Handler      ( void );
void HardFault_Handler           ( void );
void MemManagement_Handler       ( void );
void BusFault_Handler            ( void );
void UsageFault_Handler          ( void );
void SVCall_Handler              ( void );
void DebugMonitor_Handler        ( void );
void PendSV_Handler              ( void );
void SysTick_Handler             ( void );

/* Peripherals handlers */
void PM_Handler                  ( void );
void MCLK_Handler                ( void );
void OSCCTRL_XOSC0_Handler       ( void );
void OSCCTRL_XOSC1_Handler       ( void );
void OSCCTRL_DFLL_Handler        ( void );
void OSCCTRL_DPLL0_Handler       ( void );
void OSCCTRL_DPLL1_Handler       ( void );
void OSC32KCTRL_Handler          ( void );
void SUPC_OTHER_Handler          ( void );
void SUPC_BODDET_Handler         ( void );
void WDT_Handler                 ( void );
void RTC_Handler                 ( void );
void EIC_EXTINT_0_Handler        ( void );
void EIC_EXTINT_1_Handler        ( void );
void EIC_EXTINT_2_Handler        ( void );
void EIC_EXTINT_3_Handler        ( void );
void EIC_EXTINT_4_Handler        ( void );
void EIC_EXTINT_5_Handler        ( void );
void EIC_EXTINT_6_Handler        ( void );
void EIC_EXTINT_7_Handler        ( void );
void EIC_EXTINT_8_Handler        ( void );
void EIC_EXTINT_9_Handler        ( void );
void EIC_EXTINT_10_Handler       ( void );
void EIC_EXTINT_11_Handler       ( void );
void EIC_EXTINT_12_Handler       ( void );
void EIC_EXTINT_13_Handler       ( void );
void EIC_EXTINT_14_Handler       ( void );
void EIC_EXTINT_15_Handler       ( void );
void FREQM_Handler               ( void );
void NVMCTRL_0_Handler           ( void );
void NVMCTRL_1_Handler           ( void );
void DMAC_0_Handler              ( void );
void DMAC_1_Handler              ( void );
void DMAC_2_Handler              ( void );
void DMAC_3_Handler              ( void );
void DMAC_OTHER_Handler          ( void );
void EVSYS_0_Handler             ( void );
void EVSYS_1_Handler             ( void );
void EVSYS_2_Handler             ( void );
void EVSYS_3_Handler             ( void );
void EVSYS_OTHER_Handler         ( void );
void PAC_Handler                 ( void );
void RAMECC_Handler              ( void );
void SERCOM0_0_Handler           ( void );
void SERCOM0_1_Handler           ( void );
void SERCOM0_2_Handler           ( void );
void SERCOM0_OTHER_Handler       ( void );
void SERCOM1_0_Handler           ( void );
void SERCOM1_1_Handler           ( void );
void SERCOM1_2_Handler           ( void );
void SERCOM1_OTHER_Handler       ( void );
void SERCOM2_0_Handler           ( void );
void SERCOM2_1_Handler           ( void );
void SERCOM2_2_Handler           ( void );
void SERCOM2_OTHER_Handler       ( void );
void SERCOM3_0_Handler           ( void );
void SERCOM3_1_Handler           ( void );
void SERCOM3_2_Handler           ( void );
void SERCOM3_OTHER_Handler       ( void );
void SERCOM4_0_Handler           ( void );
void SERCOM4_1_Handler           ( void );
void SERCOM4_2_Handler           ( void );
void SERCOM4_OTHER_Handler       ( void );
void SERCOM5_0_Handler           ( void );
void SERCOM5_1_Handler           ( void );
void SERCOM5_2_Handler           ( void );
void SERCOM5_OTHER_Handler       ( void );
void SERCOM6_0_Handler           ( void );
void SERCOM6_1_Handler           ( void );
void SERCOM6_2_Handler           ( void );
void SERCOM6_OTHER_Handler       ( void );
void SERCOM7_0_Handler           ( void );
void SERCOM7_1_Handler           ( void );
void SERCOM7_2_Handler           ( void );
void SERCOM7_OTHER_Handler       ( void );
void CAN0_Handler                ( void );
void CAN1_Handler                ( void );
void USB_OTHER_Handler           ( void );
void USB_SOF_HSOF_Handler        ( void );
void USB_TRCPT0_Handler          ( void );
void USB_TRCPT1_Handler          ( void );
void GMAC_Handler                ( void );
void TCC0_OTHER_Handler          ( void );
void TCC0_MC0_Handler            ( void );
void TCC0_MC1_Handler            ( void );
void TCC0_MC2_Handler            ( void );
void TCC0_MC3_Handler            ( void );
void TCC0_MC4_Handler            ( void );
void TCC0_MC5_Handler            ( void );
void TCC1_OTHER_Handler          ( void );
void TCC1_MC0_Handler            ( void );
void TCC1_MC1_Handler            ( void );
void TCC1_MC2_Handler            ( void );
void TCC1_MC3_Handler            ( void );
void TCC2_OTHER_Handler          ( void );
void TCC2_MC0_Handler            ( void );
void TCC2_MC1_Handler            ( void );
void TCC2_MC2_Handler            ( void );
void TCC3_OTHER_Handler          ( void );
void TCC3_MC0_Handler            ( void );
void TCC3_MC1_Handler            ( void );
void TCC4_OTHER_Handler          ( void );
void TCC4_MC0_Handler            ( void );
void TCC4_MC1_Handler            ( void );
void TC0_Handler                 ( void );
void TC1_Handler                 ( void );
void TC2_Handler                 ( void );
void TC3_Handler                 ( void );
void TC4_Handler                 ( void );
void TC5_Handler                 ( void );
void TC6_Handler                 ( void );
void TC7_Handler                 ( void );
void PDEC_OTHER_Handler          ( void );
void PDEC_MC0_Handler            ( void );
void PDEC_MC1_Handler            ( void );
void ADC0_OTHER_Handler          ( void );
void ADC0_RESRDY_Handler         ( void );
void ADC1_OTHER_Handler          ( void );
void ADC1_RESRDY_Handler         ( void );
void AC_Handler                  ( void );
void DAC_OTHER_Handler           ( void );
void DAC_EMPTY_0_Handler         ( void );
void DAC_EMPTY_1_Handler         ( void );
void DAC_RESRDY_0_Handler        ( void );
void DAC_RESRDY_1_Handler        ( void );
void I2S_Handler                 ( void );
void PCC_Handler                 ( void );
void AES_Handler                 ( void );
void TRNG_Handler                ( void );
void ICM_Handler                 ( void );
void PUKCC_Handler               ( void );
void QSPI_Handler                ( void );
void SDHC0_Handler               ( void );
void SDHC1_Handler               ( void );

